InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/**
 *
 * @file SCB_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 22 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date Author Version Description
 * 22 jun. 2020 vyldram 1.0 initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_SCB_SCB_PERIPHERAL_SCB_REGISTER_SCB_REGISTERDEFINES_H_

#include <xDriver_MCU/Core/SCB/Peripheral/xHeader/SCB_Enum.h>
#include <xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/xHeader/SCB_RegisterDefines_INTCTLR.h>

/********************************************************************************************/
/************************************* 1 ICTLR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_ICTLR_R_INTLINESNUM_MASK    ((UBase_t) 0x0000001FUL)
#define SCB_ICTLR_R_INTLINESNUM_BIT    (0UL)
#define SCB_ICTLR_R_INTLINESNUM_0_32    ((UBase_t) 0x00000000UL)
#define SCB_ICTLR_R_INTLINESNUM_33_64    ((UBase_t) 0x00000001UL)
#define SCB_ICTLR_R_INTLINESNUM_65_96    ((UBase_t) 0x00000002UL)
#define SCB_ICTLR_R_INTLINESNUM_97_128    ((UBase_t) 0x00000003UL)
#define SCB_ICTLR_R_INTLINESNUM_129_160    ((UBase_t) 0x00000004UL)
#define SCB_ICTLR_R_INTLINESNUM_161_192    ((UBase_t) 0x00000005UL)
#define SCB_ICTLR_R_INTLINESNUM_193_224    ((UBase_t) 0x00000006UL)
#define SCB_ICTLR_R_INTLINESNUM_225_256    ((UBase_t) 0x00000007UL)

#define SCB_ICTLR_INTLINESNUM_MASK    ((UBase_t) 0x1FUL)
#define SCB_ICTLR_INTLINESNUM_0_32    ((UBase_t) 0x00UL)
#define SCB_ICTLR_INTLINESNUM_33_64    ((UBase_t) 0x01UL)
#define SCB_ICTLR_INTLINESNUM_65_96    ((UBase_t) 0x02UL)
#define SCB_ICTLR_INTLINESNUM_97_128    ((UBase_t) 0x03UL)
#define SCB_ICTLR_INTLINESNUM_129_160    ((UBase_t) 0x04UL)
#define SCB_ICTLR_INTLINESNUM_161_192    ((UBase_t) 0x05UL)
#define SCB_ICTLR_INTLINESNUM_193_224    ((UBase_t) 0x06UL)
#define SCB_ICTLR_INTLINESNUM_225_256    ((UBase_t) 0x07UL)
/*----------*/

/********************************************************************************************/
/************************************* 2 ACTLR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_ACTLR_R_DISMCYCINT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_ACTLR_R_DISMCYCINT_BIT    (0UL)
#define SCB_ACTLR_R_DISMCYCINT_DIS    ((UBase_t) 0x00000001UL)
#define SCB_ACTLR_R_DISMCYCINT_NE    ((UBase_t) 0x00000000UL)

#define SCB_ACTLR_DISMCYCINT_MASK    (1UL)
#define SCB_ACTLR_DISMCYCINT_DIS    (1UL)
#define SCB_ACTLR_DISMCYCINT_NE    (0UL)
/*----------*/

/*----------*/
#define SCB_ACTLR_R_DISDEFWBUF_MASK    ((UBase_t) 0x00000002UL)
#define SCB_ACTLR_R_DISDEFWBUF_BIT    (1UL)
#define SCB_ACTLR_R_DISDEFWBUF_DIS    ((UBase_t) 0x00000002UL)
#define SCB_ACTLR_R_DISDEFWBUF_NE    ((UBase_t) 0x00000000UL)

#define SCB_ACTLR_DISDEFWBUF_MASK    (1UL)
#define SCB_ACTLR_DISDEFWBUF_DIS    (1UL)
#define SCB_ACTLR_DISDEFWBUF_NE    (0UL)
/*----------*/

/*----------*/
#define SCB_ACTLR_R_DISFOLD_MASK    ((UBase_t) 0x00000004UL)
#define SCB_ACTLR_R_DISFOLD_BIT    (2UL)
#define SCB_ACTLR_R_DISFOLD_DIS    ((UBase_t) 0x00000004UL)
#define SCB_ACTLR_R_DISFOLD_NE    ((UBase_t) 0x00000000UL)

#define SCB_ACTLR_DISFOLD_MASK    (1UL)
#define SCB_ACTLR_DISFOLD_DIS    (1UL)
#define SCB_ACTLR_DISFOLD_NE    (0UL)
/*----------*/

/*----------*/
#define SCB_ACTLR_R_DISFPCA_MASK    ((UBase_t) 0x00000100UL)
#define SCB_ACTLR_R_DISFPCA_BIT    (8UL)
#define SCB_ACTLR_R_DISFPCA_DIS    ((UBase_t) 0x00000100UL)
#define SCB_ACTLR_R_DISFPCA_NE    ((UBase_t) 0x00000000UL)

#define SCB_ACTLR_DISFPCA_MASK    (1UL)
#define SCB_ACTLR_DISFPCA_DIS    (1UL)
#define SCB_ACTLR_DISFPCA_NE    (0UL)
/*----------*/

/*----------*/
#define SCB_ACTLR_R_DISOOFP_MASK    ((UBase_t) 0x00000200UL)
#define SCB_ACTLR_R_DISOOFP_BIT    (9UL)
#define SCB_ACTLR_R_DISOOFP_DIS    ((UBase_t) 0x00000200UL)
#define SCB_ACTLR_R_DISOOFP_NE    ((UBase_t) 0x00000000UL)

#define SCB_ACTLR_DISOOFP_MASK    (1UL)
#define SCB_ACTLR_DISOOFP_DIS    (1UL)
#define SCB_ACTLR_DISOOFP_NE    (0UL)
/*----------*/

/********************************************************************************************/
/************************************* 3 CPUID ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CPUID_R_REVISION_MASK    ((UBase_t) 0x0000000FUL)
#define SCB_CPUID_R_REVISION_BIT    (0UL)
#define SCB_CPUID_R_REVISION_r0p0    ((UBase_t) 0x00000000UL)
#define SCB_CPUID_R_REVISION_r0p1    ((UBase_t) 0x00000001UL)
#define SCB_CPUID_R_REVISION_r0p2    ((UBase_t) 0x00000002UL)
#define SCB_CPUID_R_REVISION_r0p3    ((UBase_t) 0x00000003UL)
#define SCB_CPUID_R_REVISION_r0p4    ((UBase_t) 0x00000004UL)
#define SCB_CPUID_R_REVISION_r0p5    ((UBase_t) 0x00000005UL)
#define SCB_CPUID_R_REVISION_r0p6    ((UBase_t) 0x00000006UL)
#define SCB_CPUID_R_REVISION_r0p7    ((UBase_t) 0x00000007UL)
#define SCB_CPUID_R_REVISION_r0p8    ((UBase_t) 0x00000008UL)
#define SCB_CPUID_R_REVISION_r0p9    ((UBase_t) 0x00000009UL)
#define SCB_CPUID_R_REVISION_r0p10    ((UBase_t) 0x0000000AUL)
#define SCB_CPUID_R_REVISION_r0p11    ((UBase_t) 0x0000000BUL)
#define SCB_CPUID_R_REVISION_r0p12    ((UBase_t) 0x0000000CUL)
#define SCB_CPUID_R_REVISION_r0p13    ((UBase_t) 0x0000000DUL)
#define SCB_CPUID_R_REVISION_r0p14    ((UBase_t) 0x0000000EUL)
#define SCB_CPUID_R_REVISION_r0p15    ((UBase_t) 0x0000000FUL)

#define SCB_CPUID_REVISION_MASK    ((UBase_t) 0xFUL)
#define SCB_CPUID_REVISION_rnp0    ((UBase_t) 0x0UL)
#define SCB_CPUID_REVISION_rnp1    ((UBase_t) 0x1UL)
#define SCB_CPUID_REVISION_rnp2    ((UBase_t) 0x2UL)
#define SCB_CPUID_REVISION_rnp3    ((UBase_t) 0x3UL)
#define SCB_CPUID_REVISION_rnp4    ((UBase_t) 0x4UL)
#define SCB_CPUID_REVISION_rnp5    ((UBase_t) 0x5UL)
#define SCB_CPUID_REVISION_rnp6    ((UBase_t) 0x6UL)
#define SCB_CPUID_REVISION_rnp7    ((UBase_t) 0x7UL)
#define SCB_CPUID_REVISION_rnp8    ((UBase_t) 0x8UL)
#define SCB_CPUID_REVISION_rnp9    ((UBase_t) 0x9UL)
#define SCB_CPUID_REVISION_rnp10    ((UBase_t) 0xAUL)
#define SCB_CPUID_REVISION_rnp11    ((UBase_t) 0xBUL)
#define SCB_CPUID_REVISION_rnp12    ((UBase_t) 0xCUL)
#define SCB_CPUID_REVISION_rnp13    ((UBase_t) 0xDUL)
#define SCB_CPUID_REVISION_rnp14    ((UBase_t) 0xEUL)
#define SCB_CPUID_REVISION_rnp15    ((UBase_t) 0xFUL)
/*----------*/

/*----------*/
#define SCB_CPUID_R_PARTNO_MASK    ((UBase_t) 0x0000FFF0UL)
#define SCB_CPUID_R_PARTNO_BIT    (4UL)
#define SCB_CPUID_R_PARTNO_M4    ((UBase_t) 0x0000C240UL)

