InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CPUID_PARTNO_MASK    ((UBase_t) 0xFFFUL)
#define SCB_CPUID_PARTNO_M4    ((UBase_t) 0xC24UL)
/*----------*/

/*----------*/
#define SCB_CPUID_R_CON_MASK    ((UBase_t) 0x000F0000UL)
#define SCB_CPUID_R_CON_BIT    (16UL)
#define SCB_CPUID_R_CON_0XF    ((UBase_t) 0x000F0000UL)

#define SCB_CPUID_CON_MASK    ((UBase_t) 0xFUL)
#define SCB_CPUID_CON_0xF    ((UBase_t) 0xFUL)
/*----------*/

/*----------*/
#define SCB_CPUID_R_VARIANT_MASK    ((UBase_t) 0x00F00000UL)
#define SCB_CPUID_R_VARIANT_BIT    (20UL)
#define SCB_CPUID_R_VARIANT_r0pn    ((UBase_t) 0x00000000UL)
#define SCB_CPUID_R_VARIANT_r1pn    ((UBase_t) 0x00100000UL)
#define SCB_CPUID_R_VARIANT_r2pn    ((UBase_t) 0x00200000UL)
#define SCB_CPUID_R_VARIANT_r3pn    ((UBase_t) 0x00300000UL)
#define SCB_CPUID_R_VARIANT_r4pn    ((UBase_t) 0x00400000UL)
#define SCB_CPUID_R_VARIANT_r5pn    ((UBase_t) 0x00500000UL)
#define SCB_CPUID_R_VARIANT_r6pn    ((UBase_t) 0x00600000UL)
#define SCB_CPUID_R_VARIANT_r7pn    ((UBase_t) 0x00700000UL)
#define SCB_CPUID_R_VARIANT_r8pn    ((UBase_t) 0x00800000UL)
#define SCB_CPUID_R_VARIANT_r9pn    ((UBase_t) 0x00900000UL)
#define SCB_CPUID_R_VARIANT_r10pn    ((UBase_t) 0x00A00000UL)
#define SCB_CPUID_R_VARIANT_r11pn    ((UBase_t) 0x00B00000UL)
#define SCB_CPUID_R_VARIANT_r12pn    ((UBase_t) 0x00C00000UL)
#define SCB_CPUID_R_VARIANT_r13pn    ((UBase_t) 0x00D00000UL)
#define SCB_CPUID_R_VARIANT_r14pn    ((UBase_t) 0x00E00000UL)
#define SCB_CPUID_R_VARIANT_r15pn    ((UBase_t) 0x00F00000UL)

#define SCB_CPUID_VARIANT_MASK    ((UBase_t) 0xFUL)
#define SCB_CPUID_VARIANT_r0pn    ((UBase_t) 0x0UL)
#define SCB_CPUID_VARIANT_r1pn    ((UBase_t) 0x1UL)
#define SCB_CPUID_VARIANT_r2pn    ((UBase_t) 0x2UL)
#define SCB_CPUID_VARIANT_r3pn    ((UBase_t) 0x3UL)
#define SCB_CPUID_VARIANT_r4pn    ((UBase_t) 0x4UL)
#define SCB_CPUID_VARIANT_r5pn    ((UBase_t) 0x5UL)
#define SCB_CPUID_VARIANT_r6pn    ((UBase_t) 0x6UL)
#define SCB_CPUID_VARIANT_r7pn    ((UBase_t) 0x7UL)
#define SCB_CPUID_VARIANT_r8pn    ((UBase_t) 0x8UL)
#define SCB_CPUID_VARIANT_r9pn    ((UBase_t) 0x9UL)
#define SCB_CPUID_VARIANT_r10pn    ((UBase_t) 0xAUL)
#define SCB_CPUID_VARIANT_r11pn    ((UBase_t) 0xBUL)
#define SCB_CPUID_VARIANT_r12pn    ((UBase_t) 0xCUL)
#define SCB_CPUID_VARIANT_r13pn    ((UBase_t) 0xDUL)
#define SCB_CPUID_VARIANT_r14pn    ((UBase_t) 0xEUL)
#define SCB_CPUID_VARIANT_r15pn    ((UBase_t) 0xFUL)
/*----------*/

/*----------*/
#define SCB_CPUID_R_IMPLEMENTER_MASK    ((UBase_t) 0xFF000000UL)
#define SCB_CPUID_R_IMPLEMENTER_BIT    (24UL)
#define SCB_CPUID_R_IMPLEMENTER_ARM    ((UBase_t) 0x41000000UL)

#define SCB_CPUID_IMPLEMENTER_MASK    ((UBase_t) 0xFFUL)
#define SCB_CPUID_IMPLEMENTER_ARM    ((UBase_t) 0x41UL)
/*----------*/

/********************************************************************************************/
/************************************* 5 VTOR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_VTOR_R_TBLOFF_MASK    ((UBase_t) 0xFFFFFC00UL)
#define SCB_VTOR_R_TBLOFF_BIT    (10UL)

#define SCB_VTOR_TBLOFF_MASK    ((UBase_t) 0x003FFFFFFUL)
/*----------*/

/********************************************************************************************/
/************************************* 6 AIRCR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_AIRCR_R_VECTRESET_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_R_VECTRESET_BIT    (0UL)
#define SCB_AIRCR_R_VECTRESET_NOUSE    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_R_VECTRESET_NOEFFECT    ((UBase_t) 0x00000000UL)

#define SCB_AIRCR_VECTRESET_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_VECTRESET_NOUSE    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_VECTRESET_NOEFFECT    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_AIRCR_R_VECTCLRACTIVE_MASK    ((UBase_t) 0x00000002UL)
#define SCB_AIRCR_R_VECTCLRACTIVE_BIT    (1UL)
#define SCB_AIRCR_R_VECTCLRACTIVE_NOUSE    ((UBase_t) 0x00000002UL)
#define SCB_AIRCR_R_VECTCLRACTIVE_NOEFFECT    ((UBase_t) 0x00000000UL)

#define SCB_AIRCR_VECTCLRACTIVE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_VECTCLRACTIVE_NOUSE    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_VECTCLRACTIVE_NOEFFECT    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_AIRCR_R_SYSRESETREQ_MASK    ((UBase_t) 0x00000004UL)
#define SCB_AIRCR_R_SYSRESETREQ_BIT    (2UL)
#define SCB_AIRCR_R_SYSRESETREQ_RESET    ((UBase_t) 0x00000004UL)
#define SCB_AIRCR_R_SYSRESETREQ_NOEFFECT    ((UBase_t) 0x00000000UL)

#define SCB_AIRCR_SYSRESETREQ_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_SYSRESETREQ_RESET    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_SYSRESETREQ_NOEFFECT    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_PRIGROUP_XXX    (0UL)
#define SCB_PRIGROUP_XXY    (1UL)
#define SCB_PRIGROUP_XYY    (2UL)
#define SCB_PRIGROUP_YYY    (3UL)

#define SCB_AIRCR_R_PRIGROUP_MASK    ((UBase_t) 0x00000700UL)
#define SCB_AIRCR_R_PRIGROUP_BIT    (8UL)
#define SCB_AIRCR_R_PRIGROUP_XXX    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_R_PRIGROUP_XXY    ((UBase_t) 0x00000500UL)
#define SCB_AIRCR_R_PRIGROUP_XYY    ((UBase_t) 0x00000600UL)
#define SCB_AIRCR_R_PRIGROUP_YYY    ((UBase_t) 0x00000700UL)

#define SCB_AIRCR_PRIGROUP_MASK    ((UBase_t) 0x00000007UL)
#define SCB_AIRCR_PRIGROUP_XXX    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_PRIGROUP_XXY    ((UBase_t) 0x00000005UL)
#define SCB_AIRCR_PRIGROUP_XYY    ((UBase_t) 0x00000006UL)
#define SCB_AIRCR_PRIGROUP_YYY    ((UBase_t) 0x00000007UL)
/*----------*/

/*----------*/
#define SCB_AIRCR_R_ENDIANESS_MASK    ((UBase_t) 0x00008000UL)
#define SCB_AIRCR_R_ENDIANESS_BIT    (15UL)
#define SCB_AIRCR_R_ENDIANESS_LITTLE    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_R_ENDIANESS_BIG    ((UBase_t) 0x00008000UL)

#define SCB_AIRCR_ENDIANESS_MASK    ((UBase_t) 0x00000001UL)
#define SCB_AIRCR_ENDIANESS_LITTLE    ((UBase_t) 0x00000000UL)
#define SCB_AIRCR_ENDIANESS_BIG    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_AIRCR_R_VECTKEY_MASK    ((UBase_t) 0xFFFF0000UL)
#define SCB_AIRCR_R_VECTKEY_BIT    (16UL)
#define SCB_AIRCR_R_VECTKEY_READ    ((UBase_t) 0xFA050000UL)
#define SCB_AIRCR_R_VECTKEY_WRITE    ((UBase_t) 0x05FA0000UL)

#define SCB_AIRCR_VECTKEY_MASK    ((UBase_t) 0x0000FFFFUL)
#define SCB_AIRCR_VECTKEY_READ    ((UBase_t) 0x0000FA05UL)
#define SCB_AIRCR_VECTKEY_WRITE    ((UBase_t) 0x000005FAUL)
/*----------*/

