InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/********************************************************************************************/
/************************************* 7 SCR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SCR_R_SLEEPONEXIT_MASK    ((UBase_t) 0x00000002UL)
#define SCB_SCR_R_SLEEPONEXIT_BIT    (1UL)
#define SCB_SCR_R_SLEEPONEXIT_SLEEP    ((UBase_t) 0x00000002UL)
#define SCB_SCR_R_SLEEPONEXIT_NOSLEEP    ((UBase_t) 0x00000000UL)

#define SCB_SCR_SLEEPONEXIT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SLEEPONEXIT_SLEEP    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SLEEPONEXIT_NOSLEEP    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_SLEEPDEEP_SLEEP    (0UL)
#define SCB_SLEEPDEEP_DEEPSLEEP    (1UL)

#define SCB_SCR_R_SLEEPDEEP_MASK    ((UBase_t) 0x00000004UL)
#define SCB_SCR_R_SLEEPDEEP_BIT    (2UL)
#define SCB_SCR_R_SLEEPDEEP_DEEPSLEEP    ((UBase_t) 0x00000004UL)
#define SCB_SCR_R_SLEEPDEEP_SLEEP    ((UBase_t) 0x00000000UL)

#define SCB_SCR_SLEEPDEEP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SLEEPDEEP_DEEPSLEEP    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SLEEPDEEP_SLEEP    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_SCR_R_SEVONPEND_MASK    ((UBase_t) 0x00000010UL)
#define SCB_SCR_R_SEVONPEND_BIT    (4UL)
#define SCB_SCR_R_SEVONPEND_ALL    ((UBase_t) 0x00000010UL)
#define SCB_SCR_R_SEVONPEND_ONLY    ((UBase_t) 0x00000000UL)

#define SCB_SCR_SEVONPEND_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SEVONPEND_ALL    ((UBase_t) 0x00000001UL)
#define SCB_SCR_SEVONPEND_ONLY    ((UBase_t) 0x00000000UL)
/*----------*/

/********************************************************************************************/
/************************************* 8 CCR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CCR_R_NONBASETHREDENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_R_NONBASETHREDENA_BIT    (0UL)
#define SCB_CCR_R_NONBASETHREDENA_ALL    ((UBase_t) 0x00000001UL)
#define SCB_CCR_R_NONBASETHREDENA_ONLY    ((UBase_t) 0x00000000UL)

#define SCB_CCR_NONBASETHREDENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_NONBASETHREDENA_ALL    ((UBase_t) 0x00000001UL)
#define SCB_CCR_NONBASETHREDENA_ONLY    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_CCR_R_USERSETMPEND_MASK    ((UBase_t) 0x00000002UL)
#define SCB_CCR_R_USERSETMPEND_BIT    (1UL)
#define SCB_CCR_R_USERSETMPEND_ENA    ((UBase_t) 0x00000002UL)
#define SCB_CCR_R_USERSETMPEND_DIS    ((UBase_t) 0x00000000UL)

#define SCB_CCR_USERSETMPEND_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_USERSETMPEND_ENA    ((UBase_t) 0x00000001UL)
#define SCB_CCR_USERSETMPEND_DIS    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_CCR_R_UNALIGN_TRP_MASK    ((UBase_t) 0x00000008UL)
#define SCB_CCR_R_UNALIGN_TRP_BIT    (3UL)
#define SCB_CCR_R_UNALIGN_TRP_TRAP    ((UBase_t) 0x00000008UL)
#define SCB_CCR_R_UNALIGN_TRP_NOTRAP    ((UBase_t) 0x00000000UL)

#define SCB_CCR_UNALIGN_TRP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_UNALIGN_TRP_TRAP    ((UBase_t) 0x00000001UL)
#define SCB_CCR_UNALIGN_TRP_NOTRAP    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_CCR_R_DIV_0_TRP_MASK    ((UBase_t) 0x00000010UL)
#define SCB_CCR_R_DIV_0_TRP_BIT    (4UL)
#define SCB_CCR_R_DIV_0_TRP_TRAP    ((UBase_t) 0x00000010UL)
#define SCB_CCR_R_DIV_0_TRP_NOTRAP    ((UBase_t) 0x00000000UL)

#define SCB_CCR_DIV_0_TRP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_DIV_0_TRP_TRAP    ((UBase_t) 0x00000001UL)
#define SCB_CCR_DIV_0_TRP_NOTRAP    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_CCR_R_BFHFNMIGN_MASK    ((UBase_t) 0x00000100UL)
#define SCB_CCR_R_BFHFNMIGN_BIT    (8UL)
#define SCB_CCR_R_BFHFNMIGN_ENA    ((UBase_t) 0x00000100UL)
#define SCB_CCR_R_BFHFNMIGN_DIS    ((UBase_t) 0x00000000UL)

#define SCB_CCR_BFHFNMIGN_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_BFHFNMIGN_ENA    ((UBase_t) 0x00000001UL)
#define SCB_CCR_BFHFNMIGN_DIS    ((UBase_t) 0x00000000UL)
/*----------*/

/*----------*/
#define SCB_CCR_R_STKALIGN_MASK    ((UBase_t) 0x00000200UL)
#define SCB_CCR_R_STKALIGN_BIT    (9UL)
#define SCB_CCR_R_STKALIGN_8BYTE    ((UBase_t) 0x00000200UL)
#define SCB_CCR_R_STKALIGN_4BYTE    ((UBase_t) 0x00000000UL)

#define SCB_CCR_STKALIGN_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CCR_STKALIGN_8BYTE    ((UBase_t) 0x00000001UL)
#define SCB_CCR_STKALIGN_4BYTE    ((UBase_t) 0x00000000UL)
/*----------*/

/********************************************************************************************/
/************************************* 9 SHPR1 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR1_R_MEM_MASK    ((UBase_t) 0x000000E0UL)
#define SCB_SHPR1_R_MEM_BIT    (5UL)
#define SCB_SHPR1_R_MEM_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_R_MEM_PRI1    ((UBase_t) 0x00000020UL)
#define SCB_SHPR1_R_MEM_PRI2    ((UBase_t) 0x00000040UL)
#define SCB_SHPR1_R_MEM_PRI3    ((UBase_t) 0x00000060UL)
#define SCB_SHPR1_R_MEM_PRI4    ((UBase_t) 0x00000080UL)
#define SCB_SHPR1_R_MEM_PRI5    ((UBase_t) 0x000000A0UL)
#define SCB_SHPR1_R_MEM_PRI6    ((UBase_t) 0x000000C0UL)
#define SCB_SHPR1_R_MEM_PRI7    ((UBase_t) 0x000000E0UL)

#define SCB_SHPR1_MEM_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR1_MEM_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_MEM_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR1_MEM_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR1_MEM_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR1_MEM_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR1_MEM_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR1_MEM_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR1_MEM_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

/*----------*/
#define SCB_SHPR1_R_BUS_MASK    ((UBase_t) 0x0000E000UL)
#define SCB_SHPR1_R_BUS_BIT    (13UL)
#define SCB_SHPR1_R_BUS_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_R_BUS_PRI1    ((UBase_t) 0x00002000UL)
#define SCB_SHPR1_R_BUS_PRI2    ((UBase_t) 0x00004000UL)
#define SCB_SHPR1_R_BUS_PRI3    ((UBase_t) 0x00006000UL)
#define SCB_SHPR1_R_BUS_PRI4    ((UBase_t) 0x00008000UL)
#define SCB_SHPR1_R_BUS_PRI5    ((UBase_t) 0x0000A000UL)
#define SCB_SHPR1_R_BUS_PRI6    ((UBase_t) 0x0000C000UL)
#define SCB_SHPR1_R_BUS_PRI7    ((UBase_t) 0x0000E000UL)

