InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_SHPR1_BUS_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR1_BUS_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_BUS_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR1_BUS_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR1_BUS_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR1_BUS_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR1_BUS_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR1_BUS_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR1_BUS_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

/*----------*/
#define SCB_SHPR1_R_USAGE_MASK    ((UBase_t) 0x00E00000UL)
#define SCB_SHPR1_R_USAGE_BIT    (21UL)
#define SCB_SHPR1_R_USAGE_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_R_USAGE_PRI1    ((UBase_t) 0x00200000UL)
#define SCB_SHPR1_R_USAGE_PRI2    ((UBase_t) 0x00400000UL)
#define SCB_SHPR1_R_USAGE_PRI3    ((UBase_t) 0x00600000UL)
#define SCB_SHPR1_R_USAGE_PRI4    ((UBase_t) 0x00800000UL)
#define SCB_SHPR1_R_USAGE_PRI5    ((UBase_t) 0x00A00000UL)
#define SCB_SHPR1_R_USAGE_PRI6    ((UBase_t) 0x00C00000UL)
#define SCB_SHPR1_R_USAGE_PRI7    ((UBase_t) 0x00E00000UL)

#define SCB_SHPR1_USAGE_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR1_USAGE_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR1_USAGE_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR1_USAGE_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR1_USAGE_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR1_USAGE_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR1_USAGE_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR1_USAGE_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR1_USAGE_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

/********************************************************************************************/
/************************************* 10 SHPR2 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR2_R_SVCALL_MASK    ((UBase_t) 0xE0000000UL)
#define SCB_SHPR2_R_SVCALL_BIT    (29UL)
#define SCB_SHPR2_R_SVCALL_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR2_R_SVCALL_PRI1    ((UBase_t) 0x20000000UL)
#define SCB_SHPR2_R_SVCALL_PRI2    ((UBase_t) 0x40000000UL)
#define SCB_SHPR2_R_SVCALL_PRI3    ((UBase_t) 0x60000000UL)
#define SCB_SHPR2_R_SVCALL_PRI4    ((UBase_t) 0x80000000UL)
#define SCB_SHPR2_R_SVCALL_PRI5    ((UBase_t) 0xA0000000UL)
#define SCB_SHPR2_R_SVCALL_PRI6    ((UBase_t) 0xC0000000UL)
#define SCB_SHPR2_R_SVCALL_PRI7    ((UBase_t) 0xE0000000UL)

#define SCB_SHPR2_SVCALL_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR2_SVCALL_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR2_SVCALL_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR2_SVCALL_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR2_SVCALL_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR2_SVCALL_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR2_SVCALL_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR2_SVCALL_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR2_SVCALL_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

/********************************************************************************************/
/************************************* 11 SHPR3 ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHPR3_R_DEBUG_MASK    ((UBase_t) 0x000000E0UL)
#define SCB_SHPR3_R_DEBUG_BIT    (5UL)
#define SCB_SHPR3_R_DEBUG_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_R_DEBUG_PRI1    ((UBase_t) 0x00000020UL)
#define SCB_SHPR3_R_DEBUG_PRI2    ((UBase_t) 0x00000040UL)
#define SCB_SHPR3_R_DEBUG_PRI3    ((UBase_t) 0x00000060UL)
#define SCB_SHPR3_R_DEBUG_PRI4    ((UBase_t) 0x00000080UL)
#define SCB_SHPR3_R_DEBUG_PRI5    ((UBase_t) 0x000000A0UL)
#define SCB_SHPR3_R_DEBUG_PRI6    ((UBase_t) 0x000000C0UL)
#define SCB_SHPR3_R_DEBUG_PRI7    ((UBase_t) 0x000000E0UL)

#define SCB_SHPR3_DEBUG_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR3_DEBUG_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_DEBUG_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR3_DEBUG_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR3_DEBUG_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR3_DEBUG_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR3_DEBUG_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR3_DEBUG_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR3_DEBUG_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

/*----------*/
#define SCB_SHPR3_R_PENDSV_MASK    ((UBase_t) 0x00E00000UL)
#define SCB_SHPR3_R_PENDSV_BIT    (21UL)
#define SCB_SHPR3_R_PENDSV_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_R_PENDSV_PRI1    ((UBase_t) 0x00200000UL)
#define SCB_SHPR3_R_PENDSV_PRI2    ((UBase_t) 0x00400000UL)
#define SCB_SHPR3_R_PENDSV_PRI3    ((UBase_t) 0x00600000UL)
#define SCB_SHPR3_R_PENDSV_PRI4    ((UBase_t) 0x00800000UL)
#define SCB_SHPR3_R_PENDSV_PRI5    ((UBase_t) 0x00A00000UL)
#define SCB_SHPR3_R_PENDSV_PRI6    ((UBase_t) 0x00C00000UL)
#define SCB_SHPR3_R_PENDSV_PRI7    ((UBase_t) 0x00E00000UL)

#define SCB_SHPR3_PENDSV_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR3_PENDSV_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_PENDSV_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR3_PENDSV_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR3_PENDSV_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR3_PENDSV_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR3_PENDSV_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR3_PENDSV_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR3_PENDSV_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

/*----------*/

#define SCB_SHPR3_R_SYSTICK_MASK    ((UBase_t) 0xE0000000UL)
#define SCB_SHPR3_R_SYSTICK_BIT    (29UL)
#define SCB_SHPR3_R_SYSTICK_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI1    ((UBase_t) 0x20000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI2    ((UBase_t) 0x40000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI3    ((UBase_t) 0x60000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI4    ((UBase_t) 0x80000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI5    ((UBase_t) 0xA0000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI6    ((UBase_t) 0xC0000000UL)
#define SCB_SHPR3_R_SYSTICK_PRI7    ((UBase_t) 0xE0000000UL)

#define SCB_SHPR3_SYSTICK_MASK    ((UBase_t) 0x00000007UL)
#define SCB_SHPR3_SYSTICK_PRI0    ((UBase_t) 0x00000000UL)
#define SCB_SHPR3_SYSTICK_PRI1    ((UBase_t) 0x00000001UL)
#define SCB_SHPR3_SYSTICK_PRI2    ((UBase_t) 0x00000002UL)
#define SCB_SHPR3_SYSTICK_PRI3    ((UBase_t) 0x00000003UL)
#define SCB_SHPR3_SYSTICK_PRI4    ((UBase_t) 0x00000004UL)
#define SCB_SHPR3_SYSTICK_PRI5    ((UBase_t) 0x00000005UL)
#define SCB_SHPR3_SYSTICK_PRI6    ((UBase_t) 0x00000006UL)
#define SCB_SHPR3_SYSTICK_PRI7    ((UBase_t) 0x00000007UL)
/*----------*/

