InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/********************************************************************************************/
/************************************* 12 SHCSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_SHCSR_R_MEMFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_R_MEMFAULTACT_BIT    (0UL)
#define SCB_SHCSR_R_MEMFAULTACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_MEMFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)

#define SCB_SHCSR_MEMFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_BUSFAULTACT_MASK    ((UBase_t) 0x00000002UL)
#define SCB_SHCSR_R_BUSFAULTACT_BIT    (1UL)
#define SCB_SHCSR_R_BUSFAULTACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_BUSFAULTACT_ACTIVE    ((UBase_t) 0x00000002UL)

#define SCB_SHCSR_BUSFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_USGFAULTACT_MASK    ((UBase_t) 0x00000008UL)
#define SCB_SHCSR_R_USGFAULTACT_BIT    (3UL)
#define SCB_SHCSR_R_USGFAULTACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_USGFAULTACT_ACTIVE    ((UBase_t) 0x00000008UL)

#define SCB_SHCSR_USGFAULTACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_SVCALLACT_MASK    ((UBase_t) 0x00000080UL)
#define SCB_SHCSR_R_SVCALLACT_BIT    (7UL)
#define SCB_SHCSR_R_SVCALLACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_SVCALLACT_ACTIVE    ((UBase_t) 0x00000080UL)

#define SCB_SHCSR_SVCALLACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_SVCALLACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_SVCALLACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_MONITORACT_MASK    ((UBase_t) 0x00000100UL)
#define SCB_SHCSR_R_MONITORACT_BIT    (8UL)
#define SCB_SHCSR_R_MONITORACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_MONITORACT_ACTIVE    ((UBase_t) 0x00000100UL)

#define SCB_SHCSR_MONITORACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MONITORACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MONITORACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_PENDSVACT_MASK    ((UBase_t) 0x00000400UL)
#define SCB_SHCSR_R_PENDSVACT_BIT    (10UL)
#define SCB_SHCSR_R_PENDSVACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_PENDSVACT_ACTIVE    ((UBase_t) 0x00000400UL)

#define SCB_SHCSR_PENDSVACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_PENDSVACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_PENDSVACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_SYSTICKACT_MASK    ((UBase_t) 0x00000800UL)
#define SCB_SHCSR_R_SYSTICKACT_BIT    (11UL)
#define SCB_SHCSR_R_SYSTICKACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_SYSTICKACT_ACTIVE    ((UBase_t) 0x00000800UL)

#define SCB_SHCSR_SYSTICKACT_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_SYSTICKACT_NOACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_SYSTICKACT_ACTIVE    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_USGFAULTPENDED_MASK    ((UBase_t) 0x00001000UL)
#define SCB_SHCSR_R_USGFAULTPENDED_BIT    (12UL)
#define SCB_SHCSR_R_USGFAULTPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_USGFAULTPENDED_PEND    ((UBase_t) 0x00001000UL)

#define SCB_SHCSR_USGFAULTPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTPENDED_PEND    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_MEMFAULTPENDED_MASK    ((UBase_t) 0x00002000UL)
#define SCB_SHCSR_R_MEMFAULTPENDED_BIT    (13UL)
#define SCB_SHCSR_R_MEMFAULTPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_MEMFAULTPENDED_PEND    ((UBase_t) 0x00002000UL)

#define SCB_SHCSR_MEMFAULTPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTPENDED_PEND    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_BUSFAULTPENDED_MASK    ((UBase_t) 0x00004000UL)
#define SCB_SHCSR_R_BUSFAULTPENDED_BIT    (14UL)
#define SCB_SHCSR_R_BUSFAULTPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_BUSFAULTPENDED_PEND    ((UBase_t) 0x00004000UL)

#define SCB_SHCSR_BUSFAULTPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTPENDED_PEND    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_SVCALLPENDED_MASK    ((UBase_t) 0x00008000UL)
#define SCB_SHCSR_R_SVCALLPENDED_BIT    (15UL)
#define SCB_SHCSR_R_SVCALLPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_SVCALLPENDED_PEND    ((UBase_t) 0x00008000UL)

#define SCB_SHCSR_SVCALLPENDED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_SVCALLPENDED_NOPEND    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_SVCALLPENDED_PEND    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_MEMFAULTENA_MASK    ((UBase_t) 0x00010000UL)
#define SCB_SHCSR_R_MEMFAULTENA_BIT    (16UL)
#define SCB_SHCSR_R_MEMFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_MEMFAULTENA_ENA    ((UBase_t) 0x00010000UL)

#define SCB_SHCSR_MEMFAULTENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_MEMFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_MEMFAULTENA_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_BUSFAULTENA_MASK    ((UBase_t) 0x00020000UL)
#define SCB_SHCSR_R_BUSFAULTENA_BIT    (17UL)
#define SCB_SHCSR_R_BUSFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_BUSFAULTENA_ENA    ((UBase_t) 0x00020000UL)

