InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_SHCSR_BUSFAULTENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_BUSFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_BUSFAULTENA_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_SHCSR_R_USGFAULTENA_MASK    ((UBase_t) 0x00040000UL)
#define SCB_SHCSR_R_USGFAULTENA_BIT    (18UL)
#define SCB_SHCSR_R_USGFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_R_USGFAULTENA_ENA    ((UBase_t) 0x00040000UL)

#define SCB_SHCSR_USGFAULTENA_MASK    ((UBase_t) 0x00000001UL)
#define SCB_SHCSR_USGFAULTENA_DIS    ((UBase_t) 0x00000000UL)
#define SCB_SHCSR_USGFAULTENA_ENA    ((UBase_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 13 CFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_CFSR_R_IACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_R_IACCVIOL_BIT    (0UL)
#define SCB_CFSR_R_IACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_IACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_R_IACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_CFSR_IACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_IACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_DACCVIOL_MASK    ((UBase_t) 0x00000002UL)
#define SCB_CFSR_R_DACCVIOL_BIT    (1UL)
#define SCB_CFSR_R_DACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_DACCVIOL_ACTIVE    ((UBase_t) 0x00000002UL)
#define SCB_CFSR_R_DACCVIOL_CLEAR    ((UBase_t) 0x00000002UL)

#define SCB_CFSR_DACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_DACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MUNSTKERR_MASK    ((UBase_t) 0x00000008UL)
#define SCB_CFSR_R_MUNSTKERR_BIT    (3UL)
#define SCB_CFSR_R_MUNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_MUNSTKERR_ACTIVE    ((UBase_t) 0x00000008UL)
#define SCB_CFSR_R_MUNSTKERR_CLEAR    ((UBase_t) 0x00000008UL)

#define SCB_CFSR_MUNSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MUNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MUNSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MUNSTKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MSTKERR_MASK    ((UBase_t) 0x00000010UL)
#define SCB_CFSR_R_MSTKERR_BIT    (4UL)
#define SCB_CFSR_R_MSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_MSTKERR_ACTIVE    ((UBase_t) 0x00000010UL)
#define SCB_CFSR_R_MSTKERR_CLEAR    ((UBase_t) 0x00000010UL)

#define SCB_CFSR_MSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MSTKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MLSPERR_MASK    ((UBase_t) 0x00000020UL)
#define SCB_CFSR_R_MLSPERR_BIT    (5UL)
#define SCB_CFSR_R_MLSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_MLSPERR_ACTIVE    ((UBase_t) 0x00000020UL)
#define SCB_CFSR_R_MLSPERR_CLEAR    ((UBase_t) 0x00000020UL)

#define SCB_CFSR_MLSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MLSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MLSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MLSPERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_MMARVALID_MASK    ((UBase_t) 0x00000080UL)
#define SCB_CFSR_R_MMARVALID_BIT    (7UL)
#define SCB_CFSR_R_MMARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_MMARVALID_VALID    ((UBase_t) 0x00000080UL)
#define SCB_CFSR_R_MMARVALID_CLEAR    ((UBase_t) 0x00000080UL)

#define SCB_CFSR_MMARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MMARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_MMARVALID_VALID    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_MMARVALID_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_IBUSERR_MASK    ((UBase_t) 0x00000100UL)
#define SCB_CFSR_R_IBUSERR_BIT    (8UL)
#define SCB_CFSR_R_IBUSERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_IBUSERR_ACTIVE    ((UBase_t) 0x00000100UL)
#define SCB_CFSR_R_IBUSERR_CLEAR    ((UBase_t) 0x00000100UL)

#define SCB_CFSR_IBUSERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IBUSERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_IBUSERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IBUSERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_PRECISERR_MASK    ((UBase_t) 0x00000200UL)
#define SCB_CFSR_R_PRECISERR_BIT    (9UL)
#define SCB_CFSR_R_PRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_PRECISERR_ACTIVE    ((UBase_t) 0x00000200UL)
#define SCB_CFSR_R_PRECISERR_CLEAR    ((UBase_t) 0x00000200UL)

#define SCB_CFSR_PRECISERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_PRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_PRECISERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_PRECISERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_IMPRECISERR_MASK    ((UBase_t) 0x00000400UL)
#define SCB_CFSR_R_IMPRECISERR_BIT    (10UL)
#define SCB_CFSR_R_IMPRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_IMPRECISERR_ACTIVE    ((UBase_t) 0x00000400UL)
#define SCB_CFSR_R_IMPRECISERR_CLEAR    ((UBase_t) 0x00000400UL)

#define SCB_CFSR_IMPRECISERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IMPRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_IMPRECISERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_IMPRECISERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_UNSTKERR_MASK    ((UBase_t) 0x00000800UL)
#define SCB_CFSR_R_UNSTKERR_BIT    (11UL)
#define SCB_CFSR_R_UNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_UNSTKERR_ACTIVE    ((UBase_t) 0x00000800UL)
#define SCB_CFSR_R_UNSTKERR_CLEAR    ((UBase_t) 0x00000800UL)

#define SCB_CFSR_UNSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_UNSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNSTKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_STKERR_MASK    ((UBase_t) 0x00001000UL)
#define SCB_CFSR_R_STKERR_BIT    (12UL)
#define SCB_CFSR_R_STKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_STKERR_ACTIVE    ((UBase_t) 0x00001000UL)
#define SCB_CFSR_R_STKERR_CLEAR    ((UBase_t) 0x00001000UL)

#define SCB_CFSR_STKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_STKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_STKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_STKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_LSPERR_MASK    ((UBase_t) 0x00002000UL)
#define SCB_CFSR_R_LSPERR_BIT    (13UL)
#define SCB_CFSR_R_LSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_LSPERR_ACTIVE    ((UBase_t) 0x00002000UL)
#define SCB_CFSR_R_LSPERR_CLEAR    ((UBase_t) 0x00002000UL)

#define SCB_CFSR_LSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_LSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_LSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_LSPERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_BFARVALID_MASK    ((UBase_t) 0x00008000UL)
#define SCB_CFSR_R_BFARVALID_BIT    (15UL)
#define SCB_CFSR_R_BFARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_BFARVALID_VALID    ((UBase_t) 0x00008000UL)
#define SCB_CFSR_R_BFARVALID_CLEAR    ((UBase_t) 0x00008000UL)

#define SCB_CFSR_BFARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_BFARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_BFARVALID_VALID    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_BFARVALID_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_UNDEFINSTR_MASK    ((UBase_t) 0x00010000UL)
#define SCB_CFSR_R_UNDEFINSTR_BIT    (16UL)
#define SCB_CFSR_R_UNDEFINSTR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_UNDEFINSTR_ACTIVE    ((UBase_t) 0x00010000UL)
#define SCB_CFSR_R_UNDEFINSTR_CLEAR    ((UBase_t) 0x00010000UL)

#define SCB_CFSR_UNDEFINSTR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNDEFINSTR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_UNDEFINSTR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNDEFINSTR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_INVSTATE_MASK    ((UBase_t) 0x00020000UL)
#define SCB_CFSR_R_INVSTATE_BIT    (17UL)
#define SCB_CFSR_R_INVSTATE_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_INVSTATE_ACTIVE    ((UBase_t) 0x00020000UL)
#define SCB_CFSR_R_INVSTATE_CLEAR    ((UBase_t) 0x00020000UL)

