InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
#define SCB_CFSR_INVSTATE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVSTATE_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_INVSTATE_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVSTATE_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_INVPC_MASK    ((UBase_t) 0x00040000UL)
#define SCB_CFSR_R_INVPC_BIT    (18UL)
#define SCB_CFSR_R_INVPC_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_INVPC_ACTIVE    ((UBase_t) 0x00040000UL)
#define SCB_CFSR_R_INVPC_CLEAR    ((UBase_t) 0x00040000UL)

#define SCB_CFSR_INVPC_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVPC_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_INVPC_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_INVPC_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_NOCP_MASK    ((UBase_t) 0x00080000UL)
#define SCB_CFSR_R_NOCP_BIT    (19UL)
#define SCB_CFSR_R_NOCP_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_NOCP_ACTIVE    ((UBase_t) 0x00080000UL)
#define SCB_CFSR_R_NOCP_CLEAR    ((UBase_t) 0x00080000UL)

#define SCB_CFSR_NOCP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_NOCP_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_NOCP_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_NOCP_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_UNALIGNED_MASK    ((UBase_t) 0x01000000UL)
#define SCB_CFSR_R_UNALIGNED_BIT    (24UL)
#define SCB_CFSR_R_UNALIGNED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_UUNALIGNED_ACTIVE    ((UBase_t) 0x01000000UL)
#define SCB_CFSR_R_UNALIGNED_CLEAR    ((UBase_t) 0x01000000UL)

#define SCB_CFSR_UNALIGNED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNALIGNED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_UNALIGNED_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_UNALIGNED_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_CFSR_R_DIVBYZERO_MASK    ((UBase_t) 0x02000000UL)
#define SCB_CFSR_R_DIVBYZERO_BIT    (25UL)
#define SCB_CFSR_R_DIVBYZERO_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_R_DIVBYZERO_ACTIVE    ((UBase_t) 0x02000000UL)
#define SCB_CFSR_R_DIVBYZERO_CLEAR    ((UBase_t) 0x02000000UL)

#define SCB_CFSR_DIVBYZERO_MASK    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DIVBYZERO_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_CFSR_DIVBYZERO_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_CFSR_DIVBYZERO_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 13_1 UCFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_UCFSR_R_UNDEFINSTR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_R_UNDEFINSTR_BIT    (0UL)
#define SCB_UCFSR_R_UNDEFINSTR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_R_UNDEFINSTR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_R_UNDEFINSTR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_UCFSR_UNDEFINSTR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNDEFINSTR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_UNDEFINSTR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNDEFINSTR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_INVSTATE_MASK    ((UBase_t) 0x00000002UL)
#define SCB_UCFSR_R_INVSTATE_BIT    (1UL)
#define SCB_UCFSR_R_INVSTATE_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_R_INVSTATE_ACTIVE    ((UBase_t) 0x00000002UL)
#define SCB_UCFSR_R_INVSTATE_CLEAR    ((UBase_t) 0x00000002UL)

#define SCB_UCFSR_INVSTATE_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVSTATE_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_INVSTATE_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVSTATE_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_INVPC_MASK    ((UBase_t) 0x00000004UL)
#define SCB_UCFSR_R_INVPC_BIT    (2UL)
#define SCB_UCFSR_R_INVPC_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_R_INVPC_ACTIVE    ((UBase_t) 0x00000004UL)
#define SCB_UCFSR_R_INVPC_CLEAR    ((UBase_t) 0x00000004UL)

#define SCB_UCFSR_INVPC_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVPC_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_INVPC_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_INVPC_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_NOCP_MASK    ((UBase_t) 0x00000008UL)
#define SCB_UCFSR_R_NOCP_BIT    (3UL)
#define SCB_UCFSR_R_NOCP_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_R_NOCP_ACTIVE    ((UBase_t) 0x00000008UL)
#define SCB_UCFSR_R_NOCP_CLEAR    ((UBase_t) 0x00000008UL)

#define SCB_UCFSR_NOCP_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_NOCP_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_NOCP_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_NOCP_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_UNALIGNED_MASK    ((UBase_t) 0x00000100UL)
#define SCB_UCFSR_R_UNALIGNED_BIT    (8UL)
#define SCB_UCFSR_R_UNALIGNED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_R_UUNALIGNED_ACTIVE    ((UBase_t) 0x00000100UL)
#define SCB_UCFSR_R_UNALIGNED_CLEAR    ((UBase_t) 0x00000100UL)

#define SCB_UCFSR_UNALIGNED_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNALIGNED_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_UNALIGNED_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_UNALIGNED_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_UCFSR_R_DIVBYZERO_MASK    ((UBase_t) 0x00000200UL)
#define SCB_UCFSR_R_DIVBYZERO_BIT    (9UL)
#define SCB_UCFSR_R_DIVBYZERO_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_R_DIVBYZERO_ACTIVE    ((UBase_t) 0x00000200UL)
#define SCB_UCFSR_R_DIVBYZERO_CLEAR    ((UBase_t) 0x00000200UL)

#define SCB_UCFSR_DIVBYZERO_MASK    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_DIVBYZERO_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_UCFSR_DIVBYZERO_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_UCFSR_DIVBYZERO_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

