InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/SCB/Peripheral/Register/RegisterDefines/SCB_RegisterDefines.h
/********************************************************************************************/
/************************************* 13_2 BCFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_BCFSR_R_IBUSERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_R_IBUSERR_BIT    (0UL)
#define SCB_BCFSR_R_IBUSERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_IBUSERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_R_IBUSERR_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_BCFSR_IBUSERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_IBUSERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_IBUSERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_IBUSERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_PRECISERR_MASK    ((UBase_t) 0x00000002UL)
#define SCB_BCFSR_R_PRECISERR_BIT    (1UL)
#define SCB_BCFSR_R_PRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_PRECISERR_ACTIVE    ((UBase_t) 0x00000002UL)
#define SCB_BCFSR_R_PRECISERR_CLEAR    ((UBase_t) 0x00000002UL)

#define SCB_BCFSR_PRECISERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_PRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_PRECISERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_PRECISERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_IMPRECISERR_MASK    ((UBase_t) 0x00000004UL)
#define SCB_BCFSR_R_IMPRECISERR_BIT    (2UL)
#define SCB_BCFSR_R_IMPRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_IMPRECISERR_ACTIVE    ((UBase_t) 0x00000004UL)
#define SCB_BCFSR_R_IMPRECISERR_CLEAR    ((UBase_t) 0x00000004UL)

#define SCB_BCFSR_IMPRECISERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_IMPRECISERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_IMPRECISERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_IMPRECISERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_UNSTKERR_MASK    ((UBase_t) 0x00000008UL)
#define SCB_BCFSR_R_UNSTKERR_BIT    (3UL)
#define SCB_BCFSR_R_UNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_UNSTKERR_ACTIVE    ((UBase_t) 0x00000008UL)
#define SCB_BCFSR_R_UNSTKERR_CLEAR    ((UBase_t) 0x00000008UL)

#define SCB_BCFSR_UNSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_UNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_UNSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_UNSTKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_STKERR_MASK    ((UBase_t) 0x00000010UL)
#define SCB_BCFSR_R_STKERR_BIT    (4UL)
#define SCB_BCFSR_R_STKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_STKERR_ACTIVE    ((UBase_t) 0x00000010UL)
#define SCB_BCFSR_R_STKERR_CLEAR    ((UBase_t) 0x00000010UL)

#define SCB_BCFSR_STKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_STKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_STKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_STKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_LSPERR_MASK    ((UBase_t) 0x00000020UL)
#define SCB_BCFSR_R_LSPERR_BIT    (5UL)
#define SCB_BCFSR_R_LSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_LSPERR_ACTIVE    ((UBase_t) 0x00000020UL)
#define SCB_BCFSR_R_LSPERR_CLEAR    ((UBase_t) 0x00000020UL)

#define SCB_BCFSR_LSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_LSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_LSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_LSPERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_BCFSR_R_BFARVALID_MASK    ((UBase_t) 0x00000080UL)
#define SCB_BCFSR_R_BFARVALID_BIT    (7UL)
#define SCB_BCFSR_R_BFARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_R_BFARVALID_VALID    ((UBase_t) 0x00000080UL)
#define SCB_BCFSR_R_BFARVALID_CLEAR    ((UBase_t) 0x00000080UL)

#define SCB_BCFSR_BFARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_BFARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_BCFSR_BFARVALID_VALID    ((UBase_t) 0x00000001UL)
#define SCB_BCFSR_BFARVALID_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/********************************************************************************************/
/************************************* 13_3 MCFSR ***********************************************/
/********************************************************************************************/
/*----------*/
#define SCB_MCFSR_R_IACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_R_IACCVIOL_BIT    (0UL)
#define SCB_MCFSR_R_IACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_R_IACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_R_IACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)

#define SCB_MCFSR_IACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_IACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_IACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_IACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_DACCVIOL_MASK    ((UBase_t) 0x00000002UL)
#define SCB_MCFSR_R_DACCVIOL_BIT    (1UL)
#define SCB_MCFSR_R_DACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_R_DACCVIOL_ACTIVE    ((UBase_t) 0x00000002UL)
#define SCB_MCFSR_R_DACCVIOL_CLEAR    ((UBase_t) 0x00000002UL)

#define SCB_MCFSR_DACCVIOL_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_DACCVIOL_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_DACCVIOL_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_DACCVIOL_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MUNSTKERR_MASK    ((UBase_t) 0x00000008UL)
#define SCB_MCFSR_R_MUNSTKERR_BIT    (3UL)
#define SCB_MCFSR_R_MUNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_R_MUNSTKERR_ACTIVE    ((UBase_t) 0x00000008UL)
#define SCB_MCFSR_R_MUNSTKERR_CLEAR    ((UBase_t) 0x00000008UL)

#define SCB_MCFSR_MUNSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MUNSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MUNSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MUNSTKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MSTKERR_MASK    ((UBase_t) 0x00000010UL)
#define SCB_MCFSR_R_MSTKERR_BIT    (4UL)
#define SCB_MCFSR_R_MSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_R_MSTKERR_ACTIVE    ((UBase_t) 0x00000010UL)
#define SCB_MCFSR_R_MSTKERR_CLEAR    ((UBase_t) 0x00000010UL)

#define SCB_MCFSR_MSTKERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MSTKERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MSTKERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MSTKERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MLSPERR_MASK    ((UBase_t) 0x00000020UL)
#define SCB_MCFSR_R_MLSPERR_BIT    (5UL)
#define SCB_MCFSR_R_MLSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_R_MLSPERR_ACTIVE    ((UBase_t) 0x00000020UL)
#define SCB_MCFSR_R_MLSPERR_CLEAR    ((UBase_t) 0x00000020UL)

#define SCB_MCFSR_MLSPERR_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MLSPERR_INACTIVE    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MLSPERR_ACTIVE    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MLSPERR_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

/*----------*/
#define SCB_MCFSR_R_MMARVALID_MASK    ((UBase_t) 0x00000080UL)
#define SCB_MCFSR_R_MMARVALID_BIT    (7UL)
#define SCB_MCFSR_R_MMARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_R_MMARVALID_VALID    ((UBase_t) 0x00000080UL)
#define SCB_MCFSR_R_MMARVALID_CLEAR    ((UBase_t) 0x00000080UL)

#define SCB_MCFSR_MMARVALID_MASK    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MMARVALID_NOVALID    ((UBase_t) 0x00000000UL)
#define SCB_MCFSR_MMARVALID_VALID    ((UBase_t) 0x00000001UL)
#define SCB_MCFSR_MMARVALID_CLEAR    ((UBase_t) 0x00000001UL)
/*----------*/

